using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace l10t11
{
    /*
     * Внутри класса Program объявите:
     *      1) Неотрицательную целую переменную val1, значение переменной не будет превышать 3 000 000.
     *      2) Неотрицательную целую переменную val2, значение которой будут использоваться для записи чисел IP-адреса.
     *      3) Целую переменную val3, значение переменной не будет превышать 3 000 000.
     *      4) Неотрицательную целую переменную val4, значение которой не будет превышать (или равняться) 2 в 16 степени.
     *      5) Целую переменную val5, значение которой не будет превышать (или равняться) 2 в 15 степени.
     *      6) Переменную val6, способную принимать только два значения.
     *      7) Переменную val7, способную вместить в себя значение 2 в 32 степени.
     */

    public class Program
    {
        /* Добавьте свой код ниже */
        uint val1;
        string val2;
        int val3;
        uint val4; //65536
        int val5; //32768
        bool val6;
        long val7; //4_294_967_296

        public static void Main(string[] args) { }
    }
}

