using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Ex11
{
    /*
     * Правильно структурированный и оформленный код - залог успешной командной работы!
     * Да и глаз куда больше радуется, когда ты смотришь именно на красиво оформленные
     * исходники.
     * 
     * Сейчас в программе всё выглядит мягко говоря так себе... 
     * 
     * Приведи код в порядок. Для этого достаточно:
     *      1) Выделить фрагмент кода, который мы хотим структурировать.
     *      2) В нашем случае это весь файл, поэтому выделим всё при помощи CTRL + A
     *      3) Теперь нажми "Shift ⇧ + Alt + F" (или "Shift ⇧ + Option ⌥ + F" на мак)
     * 
     * Наслаждайтесь  =)
     */

    public class Program
    {
        public static void Main(string[] args)
        {
            /* Добавьте свой код ниже */
        }
    }
}