using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Ex10
{
    /*
     * В С#, как и в других языках, существует соглашение о наименовании или "Naming Convention".
     * По сути это просто свод правил и указаний о том, как правильно называть те или иные элементы
     * внутри вашей программы. Такой подход повышает читаемость кода и упрощает командное взаимодействие
     * при работе с кодом.
     *  
     * Внутри расширения C# Dev Kit, что мы с вами установили, есть специальный механизм, который подсказывает и помогает соблюдать эти
     * соглашения. Он просто подсвечивает желтым пунктиром или тремя серыми точками те элементы, на которые не удовлетворяют
     * текущим настройкам соглашения.
     * 
     * Измените некорректные имена элементов, которые вам подсветит Visual Studio Code. 
     * 
     * "Ctrl + ." (или "Command ⌘ + ." на маке) вам в помощь!
     * 
     * ==================================================================================================
     * В некоторых командах разработки существуют устоявшиеся правила именования элементов проекта, они
     * могут отличаться от дефолтных. Поэтому внутри IDE есть возможность настраивать фильтры и логику
     * определения корректности нейминга элементов исходя из ваших потребностей!
     * 
     * Помните одну важную вещь, соглашения - это свод правил, а не жестких законов. Некоторые из текущих
     * правил поддерживаются большинством а некоторые нет. Поэтому на курсах мы будем от них немного
     * отступать, а основные правила нейминга будут отдельно упоминаться по мере прохождения материала.
     * ==================================================================================================
     */

    public class program
    {
        public static void main(string[] Args)
        {
            /* Добавьте свой код ниже */
        }
    }
}
